In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None)  # es para enseñar todas las columnas del df
pd.set_option('display.max_rows', None)     # es para enseñar todas las filas del df


import warnings
warnings.simplefilter('ignore')   # es para quitar warnings

In [2]:
from sqlalchemy import create_engine

In [3]:
# Conecta a una base de datos mysql y activa el cursor/motor

password = "".join(open('../text/mysql_pass.txt', "r").readlines()) # Me traigo el password de mysql


str_conn='mysql+pymysql://root:'+password+'@localhost:3306/blockbuster'


motor=create_engine(str_conn)

### Función para select

In [6]:
def show_df(query='select * from film;'):
                
        
        return pd.read_sql(query, motor)  # resumen

### Ejecuto 10 selects

#### Top 5 actores con mas peliculas

In [25]:
query = '''
        select actor.actor_id,
        actor.first_name, 
        actor.last_name, 
        count(film.film_id) as numfilms

        
        from actor
        join actor_film
        on actor.actor_id=actor_film.actor_id

        join film
        on actor_film.film_id=film.film_id

        group by actor.actor_id
        order by numfilms desc
        limit 5;

'''

In [26]:
show_df(query)

   actor_id first_name last_name  numfilms
0        23     SANDRA    KILMER        37
1        13        UMA      WOOD        35
2        37        VAL    BOLGER        35
3        27      JULIA   MCQUEEN        33
4        26        RIP  CRAWFORD        33

#### Top 3 actores con mas horas de película

In [27]:
query = '''
        select actor.actor_id, 
        actor.first_name, 
        actor.last_name, 
        count(film.film_id) as numfilms, 
        sum(film.length) as hrsfilms
        
        from actor
        join actor_film
        on actor.actor_id=actor_film.actor_id

        join film
        on actor_film.film_id=film.film_id

        group by actor.actor_id
        order by hrsfilms desc
        limit 5;

'''

In [28]:
show_df(query)

   actor_id first_name last_name  numfilms  hrsfilms
0        23     SANDRA    KILMER        37    4441.0
1        13        UMA      WOOD        35    4299.0
2        17      HELEN    VOIGHT        32    3974.0
3        37        VAL    BOLGER        35    3938.0
4        26        RIP  CRAWFORD        33    3803.0